Big Data: Hadoop, Spark, NoSql and IOT

NewSQL databases: which blend the benefits of relational and NoSQL databases. 

NoSQL databases: key-value, document, columnar and graph databases

Spark was developed as a way to perform certain big-data tasks in memory for better performance.

We will implement a Spark application using functional style filter/map/reduce programming capabilities. First, you will build this example using a Jupyter Docker stack that runs locally on your desktop compuyter, the you will implement it using a cloud-based Microsoft Azure HDInsight multi-node Spark cluster. 

We'll introduce Spark streaming for processing streaming data in mini-batches. Spark streaming gathers data for a short time interval you specify, then gives your that batch of data to process. Unlike Pandas dataFrame, the Spark DataFrame may contain distributed over many computers in a cluster

Internet of Things:
    - IOT billion of devices that are continuously producting data worldwide. 
    - Publish/subscribe model from IOT to connect data users with data provide
    - We will build a web-based dashboard using Freeboard.io and a sample live stream from the PubNub messaging services.
    
***A free mongoDB Atlas cloud-based cluster.***
***A multi-node Hadoop cluster running on Microsoft's Azure HDInsights cloud-based service - for this you'll use the credit that comes with a new Azure account.***

In [1]:
import sqlite3

In [21]:
connection = sqlite3.connect('books.db')

In [22]:
import pandas as pd

In [5]:
#view the authors table's contents

pd.options.display.max_columns = 10
pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

Pandas function read_sql executes a SQL query and returns a DataFrame containing the query's results. The function's arguments are:
    - A string representing the SQL query to execute
    - The SQLite database's Connection object, and in this case
    - An index_col keyboard argument indicating which column should be used as a DataFrame's row indices ( the author's id values in this case)

In [6]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [8]:
#Table contains a composite key
df = pd.read_sql("SELECT * FROM author_ISBN", connection)
df.head()

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673

# 17.2.2 Select queries

In [9]:
pd.read_sql("SELECT ID, first, last FROM authors WHERE last LIKE 'D%'", connection, index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

In [11]:
pd.read_sql("SELECT ID, first, last FROM authors WHERE first LIKE '_b%'", connection, index_col=['id'])

    first    last
id
3   Abbey  Deitel

# Sorting

In [12]:
pd.read_sql("SELECT ID, first, last FROM authors ORDER BY last DESC, first ASC", connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

# Merging data from multiple Tables: Inner JOin

In [13]:
pd.read_sql("SELECT first, last, isbn FROM authors INNER JOIN author_ISBN ON authors.id = author_ISBN.id ORDER BY last, first", connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

# Insert INTO statement

In [14]:
cursor = connection.cursor()

In [16]:
cursor = cursor.execute("INSERT INTO authors (first, last) VALUES('Sue', 'Red')")

# DELETE FROM STATEMENt

In [17]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

In [18]:
cursor.rowcount

1

# Closing the Database

In [19]:
connection.close()

# Exercise

In [23]:
pd.read_sql("SELECT title, edition FROM titles ORDER BY edition DESC", connection).head(3)

                 title  edition
0  Java How to Program       11
1   C++ How to Program       10
2     C How to Program        8

In [24]:
pd.read_sql("SELECT * FROM authors WHERE first LIKE 'A%'", connection)

   id      first    last
0   3      Abbey  Deitel
1   5  Alexander    Wald

In [28]:
pd.read_sql("SELECT isbn, title, edition, copyright FROM titles WHERE title NOT LIKE '%How to Program' ORDER BY title", connection)

         isbn                          title  edition copyright
0  0134289366      Android 6 for Programmers        3      2016
1  0135404673  Intro to Python for CS and DS        1      2020

# NoSQL key-value Databases
    - Like python dict, they store key-value pairs, but they are optimized for distributed systesms and big-data processing.
    
    Example: Implemented in Memory -> REDIS,
             Implemented on disk -> HBase
             Amazon DynamoDB
             Google Cloud Datastore and Couchbase: these are multinode databases that also supports documents/ HBase is a column-oriented database.
             
# NoSQl Document Databases
    - stores smi-structed data, such as JSON or XML documents
    - popular document dbs: MongoDB, DYnamoDB(also key-value db), Microsoft Azure Cosmos DB and Apache CouchDB
    
# NoSQL Column Databases

    - Stores structured data in columns rather than rows. Because all of a columns's elemenets are stored together, selecting all the data for a given column is more efficient.
    - In a columnar db, all the values for a given column would be stored togethers as (1,2,3,4,5) ('Paul', 'Harvey', 'Dan', 'Alexander')
    - Popular columnar dbs are: MariaDB ColumnStore and Hbase
    
# NoSQL Graph DB:

    - Stores relationships betweeen nodes and vertices
    - It is used in social media and recommendation systems
    - Research the "six degrees of separation"
        - THis is in page 743
    - Popular db Neo4j

# NewSQL dbs
    - They provide the ACID benefits from SQL dbs -> Atomicity, consistency, Isolation, Durability and blends the benefit of using NoSQL dbs
     - Popular dbs: VoltDB, MemSQL, Apache ignite and google Spanner

# Case study 17.4 A mongoDB JSON document database